## Staging: ses
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                 NAME                 |
|--------|--------------------------------------|
| add    | `aws_ses_receipt_rule.problem_email` |
|        | `aws_ses_receipt_rule.toptask_email` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ses_receipt_rule.problem_email will be created
  + resource "aws_ses_receipt_rule" "problem_email" {
      + arn           = (known after apply)
      + enabled       = true
      + id            = (known after apply)
      + name          = "feedback-collection-api-problem-email-rule"
      + recipients    = [
          + "problems@alpha.canada.ca",
        ]
      + rule_set_name = "feedback-collection-api-receipt-rules"
      + scan_enabled  = true
      + tls_policy    = (known after apply)

      + sns_action {
          + encoding  = "UTF-8"
          + position  = 1
          + topic_arn = "arn:aws:sns:ca-central-1:992382783569:feedback-collection-api-problem-topic"
        }
    }

  # aws_ses_receipt_rule.toptask_email will be created
  + resource "aws_ses_receipt_rule" "toptask_email" {
      + arn           = (known after apply)
      + enabled       = true
      + id            = (known after apply)
      + name          = "feedback-collection-api-toptask-email-rule"
      + recipients    = [
          + "surveys@alpha.canada.ca",
        ]
      + rule_set_name = "feedback-collection-api-receipt-rules"
      + scan_enabled  = true
      + tls_policy    = (known after apply)

      + sns_action {
          + encoding  = "UTF-8"
          + position  = 1
          + topic_arn = "arn:aws:sns:ca-central-1:992382783569:feedback-collection-api-toptask-topic"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
